# Temperature Rating Get Temperature Rating Id By Name Method

Source: https://www.revitapidocs.com/2026/dbacc68b-8a0a-1b8c-b628-bce13cc0d772.htm

---

| Temperature Rating Get Temperature Rating Id By Name Method |
| --- |

Gets the Conductor Temperature Rating id by given Conductor Temperature Rating name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ElementId GetTemperatureRatingIdByName(
	Document document,
	string name
)
```

```
Public Shared Function GetTemperatureRatingIdByName (
	document As Document,
	name As String
) As ElementId
```

```
public:
static ElementId^ GetTemperatureRatingIdByName(
	Document^ document,
	String^ name
)
```

```
static member GetTemperatureRatingIdByName :
        document : Document *
        name : string -> ElementId
```

#### Parameters

document Document
:   The document.

name String
:   The Conductor Temperature Rating name.

#### Return Value

ElementId
The Conductor Temperature Rating id. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document.  \-or\-  name cannot include prohibited characters, such as "{, }, \[, ], \|, ;, less\-than sign, greater\-than sign, ?, \`, \~".  \-or\-  name is an empty string. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

TemperatureRating Class Autodesk.Revit.DB.Electrical Namespace